SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_eca.h
/* Bit fields for ECA CMD */
#define _ECA_CMD_RESETVALUE                            0x00000000UL                           /**< Default value for ECA_CMD                   */
#define _ECA_CMD_MASK                                  0x0000001FUL                           /**< Mask for ECA_CMD                            */
#define _ECA_CMD_MODE_SHIFT                            0                                      /**< Shift value for ECA_MODE                    */
#define _ECA_CMD_MODE_MASK                             0x3UL                                  /**< Bit mask for ECA_MODE                       */
#define _ECA_CMD_MODE_DEFAULT                          0x00000000UL                           /**< Mode DEFAULT for ECA_CMD                    */
#define _ECA_CMD_MODE_DISABLED                         0x00000001UL                           /**< Mode DISABLED for ECA_CMD                   */
#define _ECA_CMD_MODE_CAPTURE                          0x00000002UL                           /**< Mode CAPTURE for ECA_CMD                    */
#define _ECA_CMD_MODE_PLAYBACK                         0x00000003UL                           /**< Mode PLAYBACK for ECA_CMD                   */
#define ECA_CMD_MODE_DEFAULT                           (_ECA_CMD_MODE_DEFAULT << 0)           /**< Shifted mode DEFAULT for ECA_CMD            */
#define ECA_CMD_MODE_DISABLED                          (_ECA_CMD_MODE_DISABLED << 0)          /**< Shifted mode DISABLED for ECA_CMD           */
#define ECA_CMD_MODE_CAPTURE                           (_ECA_CMD_MODE_CAPTURE << 0)           /**< Shifted mode CAPTURE for ECA_CMD            */
#define ECA_CMD_MODE_PLAYBACK                          (_ECA_CMD_MODE_PLAYBACK << 0)          /**< Shifted mode PLAYBACK for ECA_CMD           */
#define ECA_CMD_STARTEVENTCNTR                         (0x1UL << 2)                           /**< Start Event Counter                         */
#define _ECA_CMD_STARTEVENTCNTR_SHIFT                  2                                      /**< Shift value for ECA_STARTEVENTCNTR          */
#define _ECA_CMD_STARTEVENTCNTR_MASK                   0x4UL                                  /**< Bit mask for ECA_STARTEVENTCNTR             */
#define _ECA_CMD_STARTEVENTCNTR_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for ECA_CMD                    */
#define ECA_CMD_STARTEVENTCNTR_DEFAULT                 (_ECA_CMD_STARTEVENTCNTR_DEFAULT << 2) /**< Shifted mode DEFAULT for ECA_CMD            */
#define ECA_CMD_STOPEVENTCNTR                          (0x1UL << 3)                           /**< Stop Event Counter                          */
#define _ECA_CMD_STOPEVENTCNTR_SHIFT                   3                                      /**< Shift value for ECA_STOPEVENTCNTR           */
#define _ECA_CMD_STOPEVENTCNTR_MASK                    0x8UL                                  /**< Bit mask for ECA_STOPEVENTCNTR              */
#define _ECA_CMD_STOPEVENTCNTR_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for ECA_CMD                    */
#define ECA_CMD_STOPEVENTCNTR_DEFAULT                  (_ECA_CMD_STOPEVENTCNTR_DEFAULT << 3)  /**< Shifted mode DEFAULT for ECA_CMD            */
#define ECA_CMD_CLEAREVENTCNTR                         (0x1UL << 4)                           /**< Clear Event Counter                         */
#define _ECA_CMD_CLEAREVENTCNTR_SHIFT                  4                                      /**< Shift value for ECA_CLEAREVENTCNTR          */
#define _ECA_CMD_CLEAREVENTCNTR_MASK                   0x10UL                                 /**< Bit mask for ECA_CLEAREVENTCNTR             */
#define _ECA_CMD_CLEAREVENTCNTR_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for ECA_CMD                    */
#define ECA_CMD_CLEAREVENTCNTR_DEFAULT                 (_ECA_CMD_CLEAREVENTCNTR_DEFAULT << 4) /**< Shifted mode DEFAULT for ECA_CMD            */

/* Bit fields for ECA CONTROL */
#define _ECA_CONTROL_RESETVALUE                        0x00000000UL                             /**< Default value for ECA_CONTROL               */
#define _ECA_CONTROL_MASK                              0x00000003UL                             /**< Mask for ECA_CONTROL                        */
#define ECA_CONTROL_BUFMODE                            (0x1UL << 0)                             /**< Buffer Mode                                 */
#define _ECA_CONTROL_BUFMODE_SHIFT                     0                                        /**< Shift value for ECA_BUFMODE                 */
#define _ECA_CONTROL_BUFMODE_MASK                      0x1UL                                    /**< Bit mask for ECA_BUFMODE                    */
#define _ECA_CONTROL_BUFMODE_DEFAULT                   0x00000000UL                             /**< Mode DEFAULT for ECA_CONTROL                */
#define _ECA_CONTROL_BUFMODE_SINGLE                    0x00000000UL                             /**< Mode SINGLE for ECA_CONTROL                 */
#define _ECA_CONTROL_BUFMODE_DUAL                      0x00000001UL                             /**< Mode DUAL for ECA_CONTROL                   */
#define ECA_CONTROL_BUFMODE_DEFAULT                    (_ECA_CONTROL_BUFMODE_DEFAULT << 0)      /**< Shifted mode DEFAULT for ECA_CONTROL        */
#define ECA_CONTROL_BUFMODE_SINGLE                     (_ECA_CONTROL_BUFMODE_SINGLE << 0)       /**< Shifted mode SINGLE for ECA_CONTROL         */
#define ECA_CONTROL_BUFMODE_DUAL                       (_ECA_CONTROL_BUFMODE_DUAL << 0)         /**< Shifted mode DUAL for ECA_CONTROL           */
#define ECA_CONTROL_QCHANNELMODE                       (0x1UL << 1)                             /**< Q-Channel Mode                              */
#define _ECA_CONTROL_QCHANNELMODE_SHIFT                1                                        /**< Shift value for ECA_QCHANNELMODE            */
#define _ECA_CONTROL_QCHANNELMODE_MASK                 0x2UL                                    /**< Bit mask for ECA_QCHANNELMODE               */
#define _ECA_CONTROL_QCHANNELMODE_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for ECA_CONTROL                */
#define _ECA_CONTROL_QCHANNELMODE_ACCEPT               0x00000000UL                             /**< Mode ACCEPT for ECA_CONTROL                 */
#define _ECA_CONTROL_QCHANNELMODE_DENY                 0x00000001UL                             /**< Mode DENY for ECA_CONTROL                   */
#define ECA_CONTROL_QCHANNELMODE_DEFAULT               (_ECA_CONTROL_QCHANNELMODE_DEFAULT << 1) /**< Shifted mode DEFAULT for ECA_CONTROL        */
#define ECA_CONTROL_QCHANNELMODE_ACCEPT                (_ECA_CONTROL_QCHANNELMODE_ACCEPT << 1)  /**< Shifted mode ACCEPT for ECA_CONTROL         */
#define ECA_CONTROL_QCHANNELMODE_DENY                  (_ECA_CONTROL_QCHANNELMODE_DENY << 1)    /**< Shifted mode DENY for ECA_CONTROL           */

