SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_eca.h
/* Bit fields for ECA STATUS */
#define _ECA_STATUS_RESETVALUE                         0x00000000UL                                /**< Default value for ECA_STATUS                */
#define _ECA_STATUS_MASK                               0x0000000FUL                                /**< Mask for ECA_STATUS                         */
#define _ECA_STATUS_RUNMODE_SHIFT                      0                                           /**< Shift value for ECA_RUNMODE                 */
#define _ECA_STATUS_RUNMODE_MASK                       0x3UL                                       /**< Bit mask for ECA_RUNMODE                    */
#define _ECA_STATUS_RUNMODE_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for ECA_STATUS                 */
#define _ECA_STATUS_RUNMODE_DISABLED                   0x00000000UL                                /**< Mode DISABLED for ECA_STATUS                */
#define _ECA_STATUS_RUNMODE_CAPTURE                    0x00000001UL                                /**< Mode CAPTURE for ECA_STATUS                 */
#define _ECA_STATUS_RUNMODE_PLAYBACK                   0x00000002UL                                /**< Mode PLAYBACK for ECA_STATUS                */
#define ECA_STATUS_RUNMODE_DEFAULT                     (_ECA_STATUS_RUNMODE_DEFAULT << 0)          /**< Shifted mode DEFAULT for ECA_STATUS         */
#define ECA_STATUS_RUNMODE_DISABLED                    (_ECA_STATUS_RUNMODE_DISABLED << 0)         /**< Shifted mode DISABLED for ECA_STATUS        */
#define ECA_STATUS_RUNMODE_CAPTURE                     (_ECA_STATUS_RUNMODE_CAPTURE << 0)          /**< Shifted mode CAPTURE for ECA_STATUS         */
#define ECA_STATUS_RUNMODE_PLAYBACK                    (_ECA_STATUS_RUNMODE_PLAYBACK << 0)         /**< Shifted mode PLAYBACK for ECA_STATUS        */
#define ECA_STATUS_SYNCBUSY                            (0x1UL << 2)                                /**< Sync Busy                                   */
#define _ECA_STATUS_SYNCBUSY_SHIFT                     2                                           /**< Shift value for ECA_SYNCBUSY                */
#define _ECA_STATUS_SYNCBUSY_MASK                      0x4UL                                       /**< Bit mask for ECA_SYNCBUSY                   */
#define _ECA_STATUS_SYNCBUSY_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for ECA_STATUS                 */
#define ECA_STATUS_SYNCBUSY_DEFAULT                    (_ECA_STATUS_SYNCBUSY_DEFAULT << 2)         /**< Shifted mode DEFAULT for ECA_STATUS         */
#define ECA_STATUS_EVENTCNTRSTARTED                    (0x1UL << 3)                                /**< Event Counter Started                       */
#define _ECA_STATUS_EVENTCNTRSTARTED_SHIFT             3                                           /**< Shift value for ECA_EVENTCNTRSTARTED        */
#define _ECA_STATUS_EVENTCNTRSTARTED_MASK              0x8UL                                       /**< Bit mask for ECA_EVENTCNTRSTARTED           */
#define _ECA_STATUS_EVENTCNTRSTARTED_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for ECA_STATUS                 */
#define ECA_STATUS_EVENTCNTRSTARTED_DEFAULT            (_ECA_STATUS_EVENTCNTRSTARTED_DEFAULT << 3) /**< Shifted mode DEFAULT for ECA_STATUS         */

/* Bit fields for ECA IF */
#define _ECA_IF_RESETVALUE                             0x00000000UL                          /**< Default value for ECA_IF                    */
#define _ECA_IF_MASK                                   0x00003FFFUL                          /**< Mask for ECA_IF                             */
#define ECA_IF_BUF0WMIND                               (0x1UL << 0)                          /**< BUF0 Watermark Indication                   */
#define _ECA_IF_BUF0WMIND_SHIFT                        0                                     /**< Shift value for ECA_BUF0WMIND               */
#define _ECA_IF_BUF0WMIND_MASK                         0x1UL                                 /**< Bit mask for ECA_BUF0WMIND                  */
#define _ECA_IF_BUF0WMIND_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_BUF0WMIND_DEFAULT                       (_ECA_IF_BUF0WMIND_DEFAULT << 0)      /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_BUF1WMIND                               (0x1UL << 1)                          /**< BUF1 Watermark Indication                   */
#define _ECA_IF_BUF1WMIND_SHIFT                        1                                     /**< Shift value for ECA_BUF1WMIND               */
#define _ECA_IF_BUF1WMIND_MASK                         0x2UL                                 /**< Bit mask for ECA_BUF1WMIND                  */
#define _ECA_IF_BUF1WMIND_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_BUF1WMIND_DEFAULT                       (_ECA_IF_BUF1WMIND_DEFAULT << 1)      /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_BUF0FULLIND                             (0x1UL << 2)                          /**< BUF0 Full Indication                        */
#define _ECA_IF_BUF0FULLIND_SHIFT                      2                                     /**< Shift value for ECA_BUF0FULLIND             */
#define _ECA_IF_BUF0FULLIND_MASK                       0x4UL                                 /**< Bit mask for ECA_BUF0FULLIND                */
#define _ECA_IF_BUF0FULLIND_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_BUF0FULLIND_DEFAULT                     (_ECA_IF_BUF0FULLIND_DEFAULT << 2)    /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_BUF1FULLIND                             (0x1UL << 3)                          /**< BUF1 Full Indication                        */
#define _ECA_IF_BUF1FULLIND_SHIFT                      3                                     /**< Shift value for ECA_BUF1FULLIND             */
#define _ECA_IF_BUF1FULLIND_MASK                       0x8UL                                 /**< Bit mask for ECA_BUF1FULLIND                */
#define _ECA_IF_BUF1FULLIND_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_BUF1FULLIND_DEFAULT                     (_ECA_IF_BUF1FULLIND_DEFAULT << 3)    /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_STARTTRIG                               (0x1UL << 4)                          /**< Start Trigger                               */
#define _ECA_IF_STARTTRIG_SHIFT                        4                                     /**< Shift value for ECA_STARTTRIG               */
#define _ECA_IF_STARTTRIG_MASK                         0x10UL                                /**< Bit mask for ECA_STARTTRIG                  */
#define _ECA_IF_STARTTRIG_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_STARTTRIG_DEFAULT                       (_ECA_IF_STARTTRIG_DEFAULT << 4)      /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_STOPTRIG                                (0x1UL << 5)                          /**< Stop Trigger                                */
#define _ECA_IF_STOPTRIG_SHIFT                         5                                     /**< Shift value for ECA_STOPTRIG                */
#define _ECA_IF_STOPTRIG_MASK                          0x20UL                                /**< Bit mask for ECA_STOPTRIG                   */
#define _ECA_IF_STOPTRIG_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_STOPTRIG_DEFAULT                        (_ECA_IF_STOPTRIG_DEFAULT << 5)       /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_CAPTURESTART                            (0x1UL << 6)                          /**< Capture Start                               */
#define _ECA_IF_CAPTURESTART_SHIFT                     6                                     /**< Shift value for ECA_CAPTURESTART            */
#define _ECA_IF_CAPTURESTART_MASK                      0x40UL                                /**< Bit mask for ECA_CAPTURESTART               */
#define _ECA_IF_CAPTURESTART_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_CAPTURESTART_DEFAULT                    (_ECA_IF_CAPTURESTART_DEFAULT << 6)   /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_CAPTUREEND                              (0x1UL << 7)                          /**< Capture End                                 */
#define _ECA_IF_CAPTUREEND_SHIFT                       7                                     /**< Shift value for ECA_CAPTUREEND              */
#define _ECA_IF_CAPTUREEND_MASK                        0x80UL                                /**< Bit mask for ECA_CAPTUREEND                 */
#define _ECA_IF_CAPTUREEND_DEFAULT                     0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_CAPTUREEND_DEFAULT                      (_ECA_IF_CAPTUREEND_DEFAULT << 7)     /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_PLAYBACKSTART                           (0x1UL << 8)                          /**< Playback Start                              */
#define _ECA_IF_PLAYBACKSTART_SHIFT                    8                                     /**< Shift value for ECA_PLAYBACKSTART           */
#define _ECA_IF_PLAYBACKSTART_MASK                     0x100UL                               /**< Bit mask for ECA_PLAYBACKSTART              */
#define _ECA_IF_PLAYBACKSTART_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_PLAYBACKSTART_DEFAULT                   (_ECA_IF_PLAYBACKSTART_DEFAULT << 8)  /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_PLAYBACKEND                             (0x1UL << 9)                          /**< Playback End                                */
#define _ECA_IF_PLAYBACKEND_SHIFT                      9                                     /**< Shift value for ECA_PLAYBACKEND             */
#define _ECA_IF_PLAYBACKEND_MASK                       0x200UL                               /**< Bit mask for ECA_PLAYBACKEND                */
#define _ECA_IF_PLAYBACKEND_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_PLAYBACKEND_DEFAULT                     (_ECA_IF_PLAYBACKEND_DEFAULT << 9)    /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_EVENTCNTRCOMP                           (0x1UL << 10)                         /**< Event Counter Compare                       */
#define _ECA_IF_EVENTCNTRCOMP_SHIFT                    10                                    /**< Shift value for ECA_EVENTCNTRCOMP           */
#define _ECA_IF_EVENTCNTRCOMP_MASK                     0x400UL                               /**< Bit mask for ECA_EVENTCNTRCOMP              */
#define _ECA_IF_EVENTCNTRCOMP_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_EVENTCNTRCOMP_DEFAULT                   (_ECA_IF_EVENTCNTRCOMP_DEFAULT << 10) /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_FIFOORERROR                             (0x1UL << 11)                         /**< FIFO Overrun Error                          */
#define _ECA_IF_FIFOORERROR_SHIFT                      11                                    /**< Shift value for ECA_FIFOORERROR             */
#define _ECA_IF_FIFOORERROR_MASK                       0x800UL                               /**< Bit mask for ECA_FIFOORERROR                */
#define _ECA_IF_FIFOORERROR_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_FIFOORERROR_DEFAULT                     (_ECA_IF_FIFOORERROR_DEFAULT << 11)   /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_FIFOURERROR                             (0x1UL << 12)                         /**< FIFO Underrun Error                         */
#define _ECA_IF_FIFOURERROR_SHIFT                      12                                    /**< Shift value for ECA_FIFOURERROR             */
#define _ECA_IF_FIFOURERROR_MASK                       0x1000UL                              /**< Bit mask for ECA_FIFOURERROR                */
#define _ECA_IF_FIFOURERROR_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_FIFOURERROR_DEFAULT                     (_ECA_IF_FIFOURERROR_DEFAULT << 12)   /**< Shifted mode DEFAULT for ECA_IF             */
#define ECA_IF_DMABUSERROR                             (0x1UL << 13)                         /**< DMA Bus Error                               */
#define _ECA_IF_DMABUSERROR_SHIFT                      13                                    /**< Shift value for ECA_DMABUSERROR             */
#define _ECA_IF_DMABUSERROR_MASK                       0x2000UL                              /**< Bit mask for ECA_DMABUSERROR                */
#define _ECA_IF_DMABUSERROR_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for ECA_IF                     */
#define ECA_IF_DMABUSERROR_DEFAULT                     (_ECA_IF_DMABUSERROR_DEFAULT << 13)   /**< Shifted mode DEFAULT for ECA_IF             */

