SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_eca.h
/* Bit fields for ECA CAPTURESTARTDELAY */
#define _ECA_CAPTURESTARTDELAY_RESETVALUE              0x00000000UL                                /**< Default value for ECA_CAPTURESTARTDELAY     */
#define _ECA_CAPTURESTARTDELAY_MASK                    0xFFFFFFFFUL                                /**< Mask for ECA_CAPTURESTARTDELAY              */
#define _ECA_CAPTURESTARTDELAY_DELAY_SHIFT             0                                           /**< Shift value for ECA_DELAY                   */
#define _ECA_CAPTURESTARTDELAY_DELAY_MASK              0xFFFFFFFFUL                                /**< Bit mask for ECA_DELAY                      */
#define _ECA_CAPTURESTARTDELAY_DELAY_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for ECA_CAPTURESTARTDELAY      */
#define ECA_CAPTURESTARTDELAY_DELAY_DEFAULT            (_ECA_CAPTURESTARTDELAY_DELAY_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_CAPTURESTARTDELAY*/

/* Bit fields for ECA CAPTURESTOPDELAY */
#define _ECA_CAPTURESTOPDELAY_RESETVALUE               0x00000000UL                               /**< Default value for ECA_CAPTURESTOPDELAY      */
#define _ECA_CAPTURESTOPDELAY_MASK                     0xFFFFFFFFUL                               /**< Mask for ECA_CAPTURESTOPDELAY               */
#define _ECA_CAPTURESTOPDELAY_DELAY_SHIFT              0                                          /**< Shift value for ECA_DELAY                   */
#define _ECA_CAPTURESTOPDELAY_DELAY_MASK               0xFFFFFFFFUL                               /**< Bit mask for ECA_DELAY                      */
#define _ECA_CAPTURESTOPDELAY_DELAY_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for ECA_CAPTURESTOPDELAY       */
#define ECA_CAPTURESTOPDELAY_DELAY_DEFAULT             (_ECA_CAPTURESTOPDELAY_DELAY_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_CAPTURESTOPDELAY*/

/* Bit fields for ECA CAPTURERATECTRL */
#define _ECA_CAPTURERATECTRL_RESETVALUE                0x00000000UL                             /**< Default value for ECA_CAPTURERATECTRL       */
#define _ECA_CAPTURERATECTRL_MASK                      0x0000FFFFUL                             /**< Mask for ECA_CAPTURERATECTRL                */
#define _ECA_CAPTURERATECTRL_RATE_SHIFT                0                                        /**< Shift value for ECA_RATE                    */
#define _ECA_CAPTURERATECTRL_RATE_MASK                 0xFFFFUL                                 /**< Bit mask for ECA_RATE                       */
#define _ECA_CAPTURERATECTRL_RATE_DEFAULT              0x00000000UL                             /**< Mode DEFAULT for ECA_CAPTURERATECTRL        */
#define ECA_CAPTURERATECTRL_RATE_DEFAULT               (_ECA_CAPTURERATECTRL_RATE_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_CAPTURERATECTRL*/

/* Bit fields for ECA PLAYBACKCTRL */
#define _ECA_PLAYBACKCTRL_RESETVALUE                   0x00000014UL                                /**< Default value for ECA_PLAYBACKCTRL          */
#define _ECA_PLAYBACKCTRL_MASK                         0x0000001FUL                                /**< Mask for ECA_PLAYBACKCTRL                   */
#define ECA_PLAYBACKCTRL_MODE                          (0x1UL << 0)                                /**< Playback Mode                               */
#define _ECA_PLAYBACKCTRL_MODE_SHIFT                   0                                           /**< Shift value for ECA_MODE                    */
#define _ECA_PLAYBACKCTRL_MODE_MASK                    0x1UL                                       /**< Bit mask for ECA_MODE                       */
#define _ECA_PLAYBACKCTRL_MODE_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for ECA_PLAYBACKCTRL           */
#define _ECA_PLAYBACKCTRL_MODE_SINGLE                  0x00000000UL                                /**< Mode SINGLE for ECA_PLAYBACKCTRL            */
#define _ECA_PLAYBACKCTRL_MODE_LOOP                    0x00000001UL                                /**< Mode LOOP for ECA_PLAYBACKCTRL              */
#define ECA_PLAYBACKCTRL_MODE_DEFAULT                  (_ECA_PLAYBACKCTRL_MODE_DEFAULT << 0)       /**< Shifted mode DEFAULT for ECA_PLAYBACKCTRL   */
#define ECA_PLAYBACKCTRL_MODE_SINGLE                   (_ECA_PLAYBACKCTRL_MODE_SINGLE << 0)        /**< Shifted mode SINGLE for ECA_PLAYBACKCTRL    */
#define ECA_PLAYBACKCTRL_MODE_LOOP                     (_ECA_PLAYBACKCTRL_MODE_LOOP << 0)          /**< Shifted mode LOOP for ECA_PLAYBACKCTRL      */
#define ECA_PLAYBACKCTRL_COND                          (0x1UL << 1)                                /**< Playback Condition                          */
#define _ECA_PLAYBACKCTRL_COND_SHIFT                   1                                           /**< Shift value for ECA_COND                    */
#define _ECA_PLAYBACKCTRL_COND_MASK                    0x2UL                                       /**< Bit mask for ECA_COND                       */
#define _ECA_PLAYBACKCTRL_COND_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for ECA_PLAYBACKCTRL           */
#define _ECA_PLAYBACKCTRL_COND_START_TRIGGER           0x00000000UL                                /**< Mode START_TRIGGER for ECA_PLAYBACKCTRL     */
#define _ECA_PLAYBACKCTRL_COND_TIMED                   0x00000001UL                                /**< Mode TIMED for ECA_PLAYBACKCTRL             */
#define ECA_PLAYBACKCTRL_COND_DEFAULT                  (_ECA_PLAYBACKCTRL_COND_DEFAULT << 1)       /**< Shifted mode DEFAULT for ECA_PLAYBACKCTRL   */
#define ECA_PLAYBACKCTRL_COND_START_TRIGGER            (_ECA_PLAYBACKCTRL_COND_START_TRIGGER << 1) /**< Shifted mode START_TRIGGER for ECA_PLAYBACKCTRL*/
#define ECA_PLAYBACKCTRL_COND_TIMED                    (_ECA_PLAYBACKCTRL_COND_TIMED << 1)         /**< Shifted mode TIMED for ECA_PLAYBACKCTRL     */
#define _ECA_PLAYBACKCTRL_DATAWIDTH_SHIFT              2                                           /**< Shift value for ECA_DATAWIDTH               */
#define _ECA_PLAYBACKCTRL_DATAWIDTH_MASK               0x1CUL                                      /**< Bit mask for ECA_DATAWIDTH                  */
#define _ECA_PLAYBACKCTRL_DATAWIDTH_DEFAULT            0x00000005UL                                /**< Mode DEFAULT for ECA_PLAYBACKCTRL           */
#define _ECA_PLAYBACKCTRL_DATAWIDTH_BIT1               0x00000000UL                                /**< Mode BIT1 for ECA_PLAYBACKCTRL              */
#define _ECA_PLAYBACKCTRL_DATAWIDTH_BIT2               0x00000001UL                                /**< Mode BIT2 for ECA_PLAYBACKCTRL              */
#define _ECA_PLAYBACKCTRL_DATAWIDTH_BIT4               0x00000002UL                                /**< Mode BIT4 for ECA_PLAYBACKCTRL              */
#define _ECA_PLAYBACKCTRL_DATAWIDTH_BIT8               0x00000003UL                                /**< Mode BIT8 for ECA_PLAYBACKCTRL              */
#define _ECA_PLAYBACKCTRL_DATAWIDTH_BIT16              0x00000004UL                                /**< Mode BIT16 for ECA_PLAYBACKCTRL             */
#define _ECA_PLAYBACKCTRL_DATAWIDTH_BIT32              0x00000005UL                                /**< Mode BIT32 for ECA_PLAYBACKCTRL             */
#define ECA_PLAYBACKCTRL_DATAWIDTH_DEFAULT             (_ECA_PLAYBACKCTRL_DATAWIDTH_DEFAULT << 2)  /**< Shifted mode DEFAULT for ECA_PLAYBACKCTRL   */
#define ECA_PLAYBACKCTRL_DATAWIDTH_BIT1                (_ECA_PLAYBACKCTRL_DATAWIDTH_BIT1 << 2)     /**< Shifted mode BIT1 for ECA_PLAYBACKCTRL      */
#define ECA_PLAYBACKCTRL_DATAWIDTH_BIT2                (_ECA_PLAYBACKCTRL_DATAWIDTH_BIT2 << 2)     /**< Shifted mode BIT2 for ECA_PLAYBACKCTRL      */
#define ECA_PLAYBACKCTRL_DATAWIDTH_BIT4                (_ECA_PLAYBACKCTRL_DATAWIDTH_BIT4 << 2)     /**< Shifted mode BIT4 for ECA_PLAYBACKCTRL      */
#define ECA_PLAYBACKCTRL_DATAWIDTH_BIT8                (_ECA_PLAYBACKCTRL_DATAWIDTH_BIT8 << 2)     /**< Shifted mode BIT8 for ECA_PLAYBACKCTRL      */
#define ECA_PLAYBACKCTRL_DATAWIDTH_BIT16               (_ECA_PLAYBACKCTRL_DATAWIDTH_BIT16 << 2)    /**< Shifted mode BIT16 for ECA_PLAYBACKCTRL     */
#define ECA_PLAYBACKCTRL_DATAWIDTH_BIT32               (_ECA_PLAYBACKCTRL_DATAWIDTH_BIT32 << 2)    /**< Shifted mode BIT32 for ECA_PLAYBACKCTRL     */

