SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_eca.h
/* Bit fields for ECA PLAYBACKRATECTRL */
#define _ECA_PLAYBACKRATECTRL_RESETVALUE               0x00000000UL                              /**< Default value for ECA_PLAYBACKRATECTRL      */
#define _ECA_PLAYBACKRATECTRL_MASK                     0x0000FFFFUL                              /**< Mask for ECA_PLAYBACKRATECTRL               */
#define _ECA_PLAYBACKRATECTRL_RATE_SHIFT               0                                         /**< Shift value for ECA_RATE                    */
#define _ECA_PLAYBACKRATECTRL_RATE_MASK                0xFFFFUL                                  /**< Bit mask for ECA_RATE                       */
#define _ECA_PLAYBACKRATECTRL_RATE_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for ECA_PLAYBACKRATECTRL       */
#define ECA_PLAYBACKRATECTRL_RATE_DEFAULT              (_ECA_PLAYBACKRATECTRL_RATE_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_PLAYBACKRATECTRL*/

/* Bit fields for ECA EVENTCNTRCTRL */
#define _ECA_EVENTCNTRCTRL_RESETVALUE                  0x00000000UL                                      /**< Default value for ECA_EVENTCNTRCTRL         */
#define _ECA_EVENTCNTRCTRL_MASK                        0x0000001FUL                                      /**< Mask for ECA_EVENTCNTRCTRL                  */
#define ECA_EVENTCNTRCTRL_STARTMODE                    (0x1UL << 0)                                      /**< Start Mode                                  */
#define _ECA_EVENTCNTRCTRL_STARTMODE_SHIFT             0                                                 /**< Shift value for ECA_STARTMODE               */
#define _ECA_EVENTCNTRCTRL_STARTMODE_MASK              0x1UL                                             /**< Bit mask for ECA_STARTMODE                  */
#define _ECA_EVENTCNTRCTRL_STARTMODE_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for ECA_EVENTCNTRCTRL          */
#define _ECA_EVENTCNTRCTRL_STARTMODE_MANUAL            0x00000000UL                                      /**< Mode MANUAL for ECA_EVENTCNTRCTRL           */
#define _ECA_EVENTCNTRCTRL_STARTMODE_START_TRIGGER     0x00000001UL                                      /**< Mode START_TRIGGER for ECA_EVENTCNTRCTRL    */
#define ECA_EVENTCNTRCTRL_STARTMODE_DEFAULT            (_ECA_EVENTCNTRCTRL_STARTMODE_DEFAULT << 0)       /**< Shifted mode DEFAULT for ECA_EVENTCNTRCTRL  */
#define ECA_EVENTCNTRCTRL_STARTMODE_MANUAL             (_ECA_EVENTCNTRCTRL_STARTMODE_MANUAL << 0)        /**< Shifted mode MANUAL for ECA_EVENTCNTRCTRL   */
#define ECA_EVENTCNTRCTRL_STARTMODE_START_TRIGGER      (_ECA_EVENTCNTRCTRL_STARTMODE_START_TRIGGER << 0) /**< Shifted mode START_TRIGGER for ECA_EVENTCNTRCTRL*/
#define _ECA_EVENTCNTRCTRL_STOPMODE_SHIFT              1                                                 /**< Shift value for ECA_STOPMODE                */
#define _ECA_EVENTCNTRCTRL_STOPMODE_MASK               0x6UL                                             /**< Bit mask for ECA_STOPMODE                   */
#define _ECA_EVENTCNTRCTRL_STOPMODE_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for ECA_EVENTCNTRCTRL          */
#define _ECA_EVENTCNTRCTRL_STOPMODE_MANUAL             0x00000000UL                                      /**< Mode MANUAL for ECA_EVENTCNTRCTRL           */
#define _ECA_EVENTCNTRCTRL_STOPMODE_STOP_TRIGGER       0x00000001UL                                      /**< Mode STOP_TRIGGER for ECA_EVENTCNTRCTRL     */
#define _ECA_EVENTCNTRCTRL_STOPMODE_COMPARE            0x00000002UL                                      /**< Mode COMPARE for ECA_EVENTCNTRCTRL          */
#define ECA_EVENTCNTRCTRL_STOPMODE_DEFAULT             (_ECA_EVENTCNTRCTRL_STOPMODE_DEFAULT << 1)        /**< Shifted mode DEFAULT for ECA_EVENTCNTRCTRL  */
#define ECA_EVENTCNTRCTRL_STOPMODE_MANUAL              (_ECA_EVENTCNTRCTRL_STOPMODE_MANUAL << 1)         /**< Shifted mode MANUAL for ECA_EVENTCNTRCTRL   */
#define ECA_EVENTCNTRCTRL_STOPMODE_STOP_TRIGGER        (_ECA_EVENTCNTRCTRL_STOPMODE_STOP_TRIGGER << 1)   /**< Shifted mode STOP_TRIGGER for ECA_EVENTCNTRCTRL*/
#define ECA_EVENTCNTRCTRL_STOPMODE_COMPARE             (_ECA_EVENTCNTRCTRL_STOPMODE_COMPARE << 1)        /**< Shifted mode COMPARE for ECA_EVENTCNTRCTRL  */
#define _ECA_EVENTCNTRCTRL_COUNTMODE_SHIFT             3                                                 /**< Shift value for ECA_COUNTMODE               */
#define _ECA_EVENTCNTRCTRL_COUNTMODE_MASK              0x18UL                                            /**< Bit mask for ECA_COUNTMODE                  */
#define _ECA_EVENTCNTRCTRL_COUNTMODE_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for ECA_EVENTCNTRCTRL          */
#define _ECA_EVENTCNTRCTRL_COUNTMODE_ALWAYS            0x00000000UL                                      /**< Mode ALWAYS for ECA_EVENTCNTRCTRL           */
#define _ECA_EVENTCNTRCTRL_COUNTMODE_START_TRIGGER     0x00000001UL                                      /**< Mode START_TRIGGER for ECA_EVENTCNTRCTRL    */
#define _ECA_EVENTCNTRCTRL_COUNTMODE_STOP_TRIGGER      0x00000002UL                                      /**< Mode STOP_TRIGGER for ECA_EVENTCNTRCTRL     */
#define _ECA_EVENTCNTRCTRL_COUNTMODE_ALL_TRIGGER       0x00000003UL                                      /**< Mode ALL_TRIGGER for ECA_EVENTCNTRCTRL      */
#define ECA_EVENTCNTRCTRL_COUNTMODE_DEFAULT            (_ECA_EVENTCNTRCTRL_COUNTMODE_DEFAULT << 3)       /**< Shifted mode DEFAULT for ECA_EVENTCNTRCTRL  */
#define ECA_EVENTCNTRCTRL_COUNTMODE_ALWAYS             (_ECA_EVENTCNTRCTRL_COUNTMODE_ALWAYS << 3)        /**< Shifted mode ALWAYS for ECA_EVENTCNTRCTRL   */
#define ECA_EVENTCNTRCTRL_COUNTMODE_START_TRIGGER      (_ECA_EVENTCNTRCTRL_COUNTMODE_START_TRIGGER << 3) /**< Shifted mode START_TRIGGER for ECA_EVENTCNTRCTRL*/
#define ECA_EVENTCNTRCTRL_COUNTMODE_STOP_TRIGGER       (_ECA_EVENTCNTRCTRL_COUNTMODE_STOP_TRIGGER << 3)  /**< Shifted mode STOP_TRIGGER for ECA_EVENTCNTRCTRL*/
#define ECA_EVENTCNTRCTRL_COUNTMODE_ALL_TRIGGER        (_ECA_EVENTCNTRCTRL_COUNTMODE_ALL_TRIGGER << 3)   /**< Shifted mode ALL_TRIGGER for ECA_EVENTCNTRCTRL*/

/* Bit fields for ECA EVENTCNTRCOMPARE */
#define _ECA_EVENTCNTRCOMPARE_RESETVALUE               0x00000000UL                                 /**< Default value for ECA_EVENTCNTRCOMPARE      */
#define _ECA_EVENTCNTRCOMPARE_MASK                     0xFFFFFFFFUL                                 /**< Mask for ECA_EVENTCNTRCOMPARE               */
#define _ECA_EVENTCNTRCOMPARE_COMPARE_SHIFT            0                                            /**< Shift value for ECA_COMPARE                 */
#define _ECA_EVENTCNTRCOMPARE_COMPARE_MASK             0xFFFFFFFFUL                                 /**< Bit mask for ECA_COMPARE                    */
#define _ECA_EVENTCNTRCOMPARE_COMPARE_DEFAULT          0x00000000UL                                 /**< Mode DEFAULT for ECA_EVENTCNTRCOMPARE       */
#define ECA_EVENTCNTRCOMPARE_COMPARE_DEFAULT           (_ECA_EVENTCNTRCOMPARE_COMPARE_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_EVENTCNTRCOMPARE*/

/* Bit fields for ECA EVENTCNTRSTATUS */
#define _ECA_EVENTCNTRSTATUS_RESETVALUE                0x00000000UL                               /**< Default value for ECA_EVENTCNTRSTATUS       */
#define _ECA_EVENTCNTRSTATUS_MASK                      0xFFFFFFFFUL                               /**< Mask for ECA_EVENTCNTRSTATUS                */
#define _ECA_EVENTCNTRSTATUS_STATUS_SHIFT              0                                          /**< Shift value for ECA_STATUS                  */
#define _ECA_EVENTCNTRSTATUS_STATUS_MASK               0xFFFFFFFFUL                               /**< Bit mask for ECA_STATUS                     */
#define _ECA_EVENTCNTRSTATUS_STATUS_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for ECA_EVENTCNTRSTATUS        */
#define ECA_EVENTCNTRSTATUS_STATUS_DEFAULT             (_ECA_EVENTCNTRSTATUS_STATUS_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_EVENTCNTRSTATUS*/

/** @} End of group EFR32MG24_ECA_BitFields */
/** @} End of group EFR32MG24_ECA */
/** @} End of group Parts */

#endif /* EFR32MG24_ECA_H */
